/*
	Μάρκος Παντελιδάκης - ice18390228
	Το παρακάτω πρόγραμμα μεταγλωτήστηκε με gcc compiler και εκτελέστηκε σε περιβάλλον linux-Ubuntu.
*/
#include <stdio.h>
#include <stdlib.h>
#include "myStack.h"

void init(struct STACK *, int);
int push(struct STACK *, int);

int main(int argc, char **argv){
	int i, option=10, elem, temp; //Αρχικοποίηση της option με έναν ακέραιο θετικό αριθμό εκτός των 0-5 για την αποφυγή εσφαλμένης λειτουργίας του προγράμματος.
	struct STACK st1;
	struct STACK st2;
	struct STACK tempST;
	init(&st1, 10);
	init(&st2, 10);
	
	printf("\n\n-==============================-ΜΕΝΟΥ-==============================-\n");
	printf("Πατήστε:\n");
	printf("1: Τοποθέτηση αρχείου στην 1η στοίβα.\n");	
	printf("2: Αφαίρεση στοιχείου από τη 1η στοίβα.\n");
	printf("3: Μεταφορά όλων των στοιχείων της στοιχείων 1ης στοίβας στην 2η στοίβα.\n");
	printf("4: Αφαίρεση στοιχείου από τη 2η στοίβα.\n");
	printf("5: Αντιγραφή 1ης στοίβας στη 2η.\n");
	printf("0: Για τον τερματισμό του προγράμματος.\n");
	printf("---------------------\n");
	
	while(option != 0){
		printf("\nΕπιλογή: ");
		scanf("%d", &option);
		
		switch(option){
			case 1:
				printf("\nΕισάγετε το στοιχείο που θέλετε να τοποθετηθεί στη 1η στοίβα: ");
				scanf("%d", &elem);
				if(!push(&st1, elem))
					printf("\nΗ 1η στοίβα είναι γεμάτη!\n");
				else{
					printf("\n-=================================================-");
					printf("\nΤο στοιχείο προστέθηκε στη στοίβα με επιτυχία!\n");
				}
			break;
			
			case 2:
				if(!pop(&st1, &elem))
					printf("\nΗ 1η στοίβα είναι άδεια!\n");
				else{
					printf("\n-================================================================-");
					printf("\nΤο τελευταίο στοιχείο της 1ης στοίβας αφαιρέθηκε με επιτυχία!\n");
				}
			break;
			
			case 3:
				while(pop(&st1, &temp))
					if(!push(&st2, temp))
						printf("\nΗ 2η στοίβα είναι γεμάτη!");
					else{
						printf("\n-==================================================================-");
						printf("\n   Τα στοιχεία της 1ης στοίβας μεταφέρθηκαν στη 2η με επιτυχία!");
						printf("\n-==================================================================-\n");
					}
			break;
			
			case 4:
				if(!pop(&st2, &elem))
					printf("\nΗ 2η στοίβα είναι άδεια!\n");
				else{
					printf("\n-==============================================================-");
					printf("\nΤο τελευταίο στοιχείο της 2ης στοίβας αφαιρέθηκε με επιτυχία!\n");
				}		
			break;
			
			case 5:
			init(&tempST, 10);
			elem = 0;
			while(pop(&st1, &elem))
				if(!push(&tempST, elem))
					printf("\nΗ προσωρινή στοίβα είναι γεμάτη!");
			while(pop(&st2, &elem)){}
			while(pop(&tempST, &elem)){
				if(!push(&st1, elem))
					printf("\nΗ 1η στοίβα είναι γεμάτη!");
				if(!push(&st2, elem))
					printf("\nΗ 2η στοίβα είναι γεμάτη!");
				else{
					printf("\n-==================================================================-");
					printf("\n   Τα στοιχεία της 1ης στοίβας αντιγράφτηκαν στη 2η με επιτυχία!");
					printf("\n-==================================================================-\n");
				}
			}
			break;
		}
	}
	
	free(st1.mat);
	free(st2.mat);
	free(tempST.mat);
	printf("\nΑντίο!\n");
	return 0;
}